# 1. Напишите программу, в которой пользователь вводит целое число
# а программа определяет, сколько в этом числе цифр 0, 1, 2 и так далее
# до 9.

num = input("Enter Number: ")
n_0 = n_1 = n_2 = n_3 = n_4 = n_5 = n_6 = n_7 = n_8 = n_9 = 0
for i in num:
    if i == "0":
        n_0 += 1
    if i == "1":
        n_1 += 1
    if i == "2":
        n_2 += 1
    if i == "3":
        n_3 += 1
    if i == "4":
        n_4 += 1
    if i == "5":
        n_5 += 1
    if i == "6":
        n_6 += 1
    if i == "7":
        n_7 += 1
    if i == "8":
        n_8 += 1
    if i == "9":
        n_9 += 1

print(f"number of digits:  0 - {n_0}, 1 - {n_1}, 2 - {n_2}, 3 - {n_3}, 4 - {n_4}, 5 - {n_5}, "
      f"6 - {n_6}, 7 - {n_7}, 8 - {n_8}, 9 - {n_9}")


