# 9. Создать матрицу, найти максимальное значение матрицы.

ml = [[44,4,1],
      [5,22,8],
      [9,11,0]]

max = 0
for i in ml:
    for b in i:
        if max < b:
            max = b

print(max)
